app/Models/ModelAuth.php

SELECT *
FROM `user`
WHERE `username` = 'admin1nihbos'
---
        public function login($username)
        {
             $useTimestamps = true;
                return $this->db->table('user')->where([
                    'username'=>$username
                ])->get()->getRowArray();